Catalogs/Виджеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Виджеты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаВиджета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоказателейДляВывода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаВиджета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПодвала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВМатрицеТалантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПоказателиВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПоказателиВиджетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияВиджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Виджеты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Данные виджетов
//
// Параметры:
//  Виджеты	 - Массив - массив виджетов (СправочникСсылка.Виджеты)
// 
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение: - Данные виджетов:
// 	 * Ключ - Строка - Виджет.
// 	 * Значение -  Структура - Данные виджета. См. Справочники.Виджеты.НовыйДанныеВиджета.
//
Функция ДанныеВиджетов(Виджеты) Экспорт
	
	ДанныеВиджетов = Новый Соответствие;
	
	РезультатЗапроса = РезультатЗапросаДанныхВиджетов(Виджеты);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеВиджета = СформироватьДанныеВиджета(Выборка);
		ДанныеВиджетов[Выборка.Ссылка] = ДанныеВиджета;
	КонецЦикла;
	
	Возврат ДанныеВиджетов;
	
КонецФункции

// Формирует структуру данных виджета.
//
// Возвращаемое значение:
//  Структура - Новый данные виджета:
//   * Имя - Строка.
//   * Ссылка - СправочникСсылка.Виджеты.
//   * Наименование - Строка.
//   * Цвет - Цвет.
//   * ПоказательЗаголовка - Структура. См. Справочники.ПоказателиВиджетов.НовыйДанныеПоказателяВиджета.
//   * ОсновныеПоказатели - Массив
//
Функция НовыйДанныеВиджета() Экспорт
	
	ДанныеВиджета = Новый Структура;
	ДанныеВиджета.Вставить("Имя", "");
	ДанныеВиджета.Вставить("Ссылка", Справочники.Виджеты.ПустаяСсылка());
	ДанныеВиджета.Вставить("Наименование", "");
	ДанныеВиджета.Вставить("Цвет", ЦветаСтиля.ЦветФонаВиджета);
	ДанныеВиджета.Вставить("Ширина", 23);
	ДанныеВиджета.Вставить("Высота", 10);
	ДанныеВиджета.Вставить("КоличествоСтрок", 3);
	ДанныеВиджета.Вставить("ПоказательЗаголовка", Справочники.ПоказателиВиджетов.НовыйДанныеПоказателяВиджета());
	ДанныеВиджета.Вставить("ПоказательПодвала", Справочники.ПоказателиВиджетов.НовыйДанныеПоказателяВиджета());
	ДанныеВиджета.Вставить("ОсновныеПоказатели", Новый Массив);
	
	Возврат ДанныеВиджета;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатЗапросаДанныхВиджетов(Виджеты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Виджеты.Ссылка КАК Ссылка,
		|	Виджеты.Наименование КАК Наименование,
		|	Виджеты.Цвет КАК Цвет,
		|	Виджеты.ПоказательЗаголовка КАК Показатель,
		|	Виджеты.ПоказательЗаголовка.Выражение КАК ПоказательВыражение,
		|	Виджеты.ПоказательЗаголовка.Действие КАК ПоказательДействие,
		|	Виджеты.ПоказательЗаголовка.Источник КАК ПоказательИсточник,
		|	Виджеты.ПоказательЗаголовка.Шрифт КАК ПоказательШрифт,
		|	Виджеты.ПоказательЗаголовка.АлгоритмДействия КАК ПоказательАлгоритмДействия,
		|	Виджеты.ШиринаВиджета КАК ШиринаВиджета,
		|	Виджеты.ВысотаВиджета КАК ВысотаВиджета,
		|	Виджеты.КоличествоПоказателейДляВывода КАК КоличествоПоказателейДляВывода,
		|	Виджеты.ОсновныеПоказатели.(
		|		Показатель КАК Показатель,
		|		Показатель.Выражение КАК ПоказательВыражение,
		|		Показатель.Действие КАК ПоказательДействие,
		|		Показатель.Источник КАК ПоказательИсточник,
		|		Показатель.Шрифт КАК ПоказательШрифт,
		|		Показатель.АлгоритмДействия КАК ПоказательАлгоритмДействия
		|	) КАК ОсновныеПоказатели,
		|	Виджеты.ПоказательПодвала КАК ПоказательПодвала,
		|	Виджеты.ПоказательПодвала.Выражение КАК ПоказательПодвалаВыражение,
		|	Виджеты.ПоказательПодвала.Действие КАК ПоказательПодвалаДействие,
		|	Виджеты.ПоказательПодвала.Источник КАК ПоказательПодвалаИсточник,
		|	Виджеты.ПоказательПодвала.Шрифт КАК ПоказательПодвалаШрифт,
		|	Виджеты.ПоказательПодвала.АлгоритмДействия КАК ПоказательПодвалаАлгоритмДействия
		|ИЗ
		|	Справочник.Виджеты КАК Виджеты
		|ГДЕ
		|	Виджеты.Ссылка В(&Виджеты)
		|	И Виджеты.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Виджеты", Виджеты);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СформироватьДанныеВиджета(Выборка)
	
	ДанныеВиджета = НовыйДанныеВиджета();
	
	ДанныеВиджета.Имя = СтрЗаменить(Строка(Выборка.Ссылка.УникальныйИдентификатор()), "-", "");
	ДанныеВиджета.Ссылка = Выборка.Ссылка;
	ДанныеВиджета.Наименование = Выборка.Наименование;
	
	ЦветВиджета = Выборка.Цвет.Получить();
	ЗаполнитьДанныеВиджета(ДанныеВиджета, "Цвет", ЦветВиджета);
	ЗаполнитьДанныеВиджета(ДанныеВиджета, "Ширина", Выборка.ШиринаВиджета);
	ЗаполнитьДанныеВиджета(ДанныеВиджета, "Высота", Выборка.ВысотаВиджета);
	ЗаполнитьДанныеВиджета(ДанныеВиджета, "КоличествоСтрок", Выборка.КоличествоПоказателейДляВывода);
	
	Если ЗначениеЗаполнено(Выборка.Показатель) Тогда
		ДанныеВиджета.ПоказательЗаголовка = ДанныеПоказателяВиджета(Выборка, "Показатель");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ПоказательПодвала) Тогда
		ДанныеВиджета.ПоказательПодвала = ДанныеПоказателяВиджета(Выборка, "ПоказательПодвала");
	КонецЕсли;
	
	ОсновныеПоказатели = Выборка.ОсновныеПоказатели.Выгрузить();
	Для Каждого Показатель Из ОсновныеПоказатели Цикл
		ПоказательВиджета = ДанныеПоказателяВиджета(Показатель, "Показатель");
		ДанныеВиджета.ОсновныеПоказатели.Добавить(ПоказательВиджета);
	КонецЦикла;
	
	Возврат ДанныеВиджета;
	
КонецФункции

Процедура ЗаполнитьДанныеВиджета(ДанныеВиджета, ИмяПараметра, Значение)
	
	Если ДанныеВиджета.Свойство(ИмяПараметра) И ЗначениеЗаполнено(Значение) Тогда
		ДанныеВиджета[ИмяПараметра] = Значение;
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеПоказателяВиджета(ДанныеПоказателя, ПрефиксПоказателя)
	
	ПоказательВиджета = Справочники.ПоказателиВиджетов.НовыйДанныеПоказателяВиджета();
	ПоказательВиджета.Ссылка = ДанныеПоказателя[ПрефиксПоказателя];
	ПоказательВиджета.Выражение = ДанныеПоказателя[ПрефиксПоказателя + "Выражение"];
	ПоказательВиджета.Действие = ДанныеПоказателя[ПрефиксПоказателя + "Действие"];
	ПоказательВиджета.Источник = ДанныеПоказателя[ПрефиксПоказателя + "Источник"];
	ПоказательВиджета.АлгоритмДействия = ДанныеПоказателя[ПрефиксПоказателя + "АлгоритмДействия"];
	
	ШрифтПоказателя = ДанныеПоказателя.ПоказательШрифт.Получить();
	Если ШрифтПоказателя <> Неопределено Тогда
		ПоказательВиджета.Шрифт = ШрифтПоказателя;
	КонецЕсли;
	
	Возврат ПоказательВиджета;
	
КонецФункции

#КонецОбласти

#КонецЕсли
